#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/initialised-si/JoWe-Web-Dev/runs/run-7VNH7Lq1PtcDw3Pw

Waiting for the plan to start...

Terraform v1.5.3
on linux_amd64
Initializing plugins and modules...
module.web.aws_cloudfront_origin_access_identity.jowe_web: Refreshing state... [id=E2WK19VXEQOQCH]
module.web.aws_s3_bucket.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_versioning.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refreshing...
module.web.aws_s3_bucket_public_access_block.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_ownership_controls.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refresh complete after 0s [id=3228599042]
module.web.aws_s3_bucket_policy.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_cloudfront_distribution.jowe_web: Refreshing state... [id=E36U11KHAWUB2P]
module.web.aws_s3_bucket_acl.jowe_web: Refreshing state... [id=jowe-dev.initialised.si,private]
module.web.aws_s3_object.upload_webapp["static/css/main.61b89840.css.map"]: Refreshing state... [id=static/css/main.61b89840.css.map]
module.web.aws_s3_object.upload_webapp["static/js/612.1313f78c.chunk.js"]: Refreshing state... [id=static/js/612.1313f78c.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js"]: Refreshing state... [id=static/js/698.1c688865.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/777.cf1c154f.chunk.js"]: Refreshing state... [id=static/js/777.cf1c154f.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/main.e083a45e.js.map"]: Refreshing state... [id=static/js/main.e083a45e.js.map]
module.web.aws_s3_object.upload_webapp["static/css/612.11e8f03c.chunk.css.map"]: Refreshing state... [id=static/css/612.11e8f03c.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/css/main.61b89840.css"]: Refreshing state... [id=static/css/main.61b89840.css]
module.web.aws_s3_object.upload_webapp["static/js/106.28d48f53.chunk.js"]: Refreshing state... [id=static/js/106.28d48f53.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/612.1313f78c.chunk.js.map"]: Refreshing state... [id=static/js/612.1313f78c.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/279.6379b73f.chunk.js.LICENSE.txt"]: Refreshing state... [id=static/js/279.6379b73f.chunk.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/924.16f99540.chunk.js"]: Refreshing state... [id=static/js/924.16f99540.chunk.js]
module.web.aws_s3_object.upload_webapp["manifest.json"]: Refreshing state... [id=manifest.json]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-female.9d832d02f50e90f40bbe.jpg"]: Refreshing state... [id=static/media/anonymous-female.9d832d02f50e90f40bbe.jpg]
module.web.aws_s3_object.upload_webapp["static/js/279.6379b73f.chunk.js.map"]: Refreshing state... [id=static/js/279.6379b73f.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/924.16f99540.chunk.js.map"]: Refreshing state... [id=static/js/924.16f99540.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg"]: Refreshing state... [id=static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg]
module.web.aws_s3_object.upload_webapp["static/js/777.cf1c154f.chunk.js.map"]: Refreshing state... [id=static/js/777.cf1c154f.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/106.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css"]: Refreshing state... [id=static/css/106.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/css/612.11e8f03c.chunk.css"]: Refreshing state... [id=static/css/612.11e8f03c.chunk.css]
module.web.aws_s3_object.upload_webapp["index.html"]: Refreshing state... [id=index.html]
module.web.aws_s3_object.upload_webapp["static/js/279.6379b73f.chunk.js"]: Refreshing state... [id=static/js/279.6379b73f.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/726.51f7dd57.chunk.js"]: Refreshing state... [id=static/js/726.51f7dd57.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/777.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/726.51f7dd57.chunk.js.map"]: Refreshing state... [id=static/js/726.51f7dd57.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/main.e083a45e.js.LICENSE.txt"]: Refreshing state... [id=static/js/main.e083a45e.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/496.71d68e66.chunk.js.map"]: Refreshing state... [id=static/js/496.71d68e66.chunk.js.map]
module.web.aws_s3_object.upload_webapp["asset-manifest.json"]: Refreshing state... [id=asset-manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/main.e083a45e.js"]: Refreshing state... [id=static/js/main.e083a45e.js]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js.map"]: Refreshing state... [id=static/js/698.1c688865.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/106.28d48f53.chunk.js.map"]: Refreshing state... [id=static/js/106.28d48f53.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css"]: Refreshing state... [id=static/css/777.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.web.aws_s3_object.upload_webapp["static/js/496.71d68e66.chunk.js"]: Refreshing state... [id=static/js/496.71d68e66.chunk.js]
module.web.aws_s3_bucket.jowe_web: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.e083a45e.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.e083a45e.js.LICENSE.txt"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.e083a45e.js"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.web.aws_s3_object.upload_webapp["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "e97e0e0797a3957c2baba57ef1f85792" -> "c09eeee0d19b6837f0118a104997f8a1"
        id                     = "asset-manifest.json"
        tags                   = {}
      ~ version_id             = "B9m.nys1lNeVjWkMIlhBulUdpzVfjXm2" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "d5b09804b2374d2bd427ba58d09996bb" -> "1b92d08b6dcb8841b5a4d20bf5240615"
        id                     = "index.html"
        tags                   = {}
      ~ version_id             = "Uho9GsTkhSsTS0rXTxIUV4YQxB_Lfdvw" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/231.e92e574f.chunk.css"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = "8bd456635524513bb0fc76ac5ad746b4"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/231.e92e574f.chunk.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/231.e92e574f.chunk.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/231.e92e574f.chunk.css.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "6dbb2def45b7e81c412932fc018fe0ec"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/231.e92e574f.chunk.css.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/231.e92e574f.chunk.css.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/612.11e8f03c.chunk.css"] will be destroyed
  # (because key ["static/css/612.11e8f03c.chunk.css"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/css; charset=utf-8" -> null
      - etag                   = "2084e2d3e64165e964600deb61345b4a" -> null
      - force_destroy          = false -> null
      - id                     = "static/css/612.11e8f03c.chunk.css" -> null
      - key                    = "static/css/612.11e8f03c.chunk.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/css/612.11e8f03c.chunk.css" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "4pm_SbyxcxrdwVE72e_7qccj0mVAcBfc" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/css/612.11e8f03c.chunk.css.map"] will be destroyed
  # (because key ["static/css/612.11e8f03c.chunk.css.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "81e0574e15634d72b0a4e785489e68ad" -> null
      - force_destroy          = false -> null
      - id                     = "static/css/612.11e8f03c.chunk.css.map" -> null
      - key                    = "static/css/612.11e8f03c.chunk.css.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/css/612.11e8f03c.chunk.css.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "uvtNZNFWFIXD4xAD9PTDQ5.ttRgYDZXP" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/css/main.61b89840.css"] will be destroyed
  # (because key ["static/css/main.61b89840.css"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/css; charset=utf-8" -> null
      - etag                   = "41cbe9379bef680be9ffcdbc146b616c" -> null
      - force_destroy          = false -> null
      - id                     = "static/css/main.61b89840.css" -> null
      - key                    = "static/css/main.61b89840.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/css/main.61b89840.css" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "eB.s8NV6IQ7UYEWiJh4SnWGuJPbRWsve" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/css/main.61b89840.css.map"] will be destroyed
  # (because key ["static/css/main.61b89840.css.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "6bea9bee92a5b783579692bb8f88825f" -> null
      - force_destroy          = false -> null
      - id                     = "static/css/main.61b89840.css.map" -> null
      - key                    = "static/css/main.61b89840.css.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/css/main.61b89840.css.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "NpV0t0u1caK5fULoV1YdYNzlsTyyyqtR" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/css/main.7c8da9df.css"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = "41f0c09171111be4514026f2c4e1dae5"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/main.7c8da9df.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/main.7c8da9df.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/main.7c8da9df.css.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "49b06f09d52f7f85d10ed550608ce8d7"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/main.7c8da9df.css.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/main.7c8da9df.css.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/106.28d48f53.chunk.js"] will be destroyed
  # (because key ["static/js/106.28d48f53.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "81ab52f823c442a3b085c846d05fcc4d" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/106.28d48f53.chunk.js" -> null
      - key                    = "static/js/106.28d48f53.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/106.28d48f53.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "W4needFZ.6PpOA8LXvcz8jrmifF_VFE5" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/106.28d48f53.chunk.js.map"] will be destroyed
  # (because key ["static/js/106.28d48f53.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "01aebf7f3989e2eccf53c85342ee9fc0" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/106.28d48f53.chunk.js.map" -> null
      - key                    = "static/js/106.28d48f53.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/106.28d48f53.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "e7fYKPMXPxJm0GLnCIhzAQ0OV1CWOHJD" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/106.9af64110.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "a54313019ca981544ab8b2c251ddced2"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/106.9af64110.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/106.9af64110.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/106.9af64110.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "01d6855b6872bcc51e475d160a4d9711"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/106.9af64110.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/106.9af64110.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/150.5291fc9d.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "b761c40c3369465ede10f78d4080cb10"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/150.5291fc9d.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/150.5291fc9d.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/150.5291fc9d.chunk.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "6643caad8bd2dc843e39e7ff46b00131"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/150.5291fc9d.chunk.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/150.5291fc9d.chunk.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/150.5291fc9d.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "ee3efbc4809d3cd693496bc81116c2df"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/150.5291fc9d.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/150.5291fc9d.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/231.2b5285c2.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "244c2e30094d687ecf9376c2055b3173"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/231.2b5285c2.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/231.2b5285c2.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/231.2b5285c2.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "5fe38924e9da7504e8fb94fc7664ec4a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/231.2b5285c2.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/231.2b5285c2.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/279.6379b73f.chunk.js"] will be destroyed
  # (because key ["static/js/279.6379b73f.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "a221c8fc2d6f49e2e1e29bb469d11659" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/279.6379b73f.chunk.js" -> null
      - key                    = "static/js/279.6379b73f.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/279.6379b73f.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "IhwWkNgmCoT9_e3FuyY1fAg6KTfEd27V" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/279.6379b73f.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/279.6379b73f.chunk.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "686f404fb6748c84bd90802c573b89fc" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/279.6379b73f.chunk.js.LICENSE.txt" -> null
      - key                    = "static/js/279.6379b73f.chunk.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/279.6379b73f.chunk.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "hr5T8Pxy2VmaAfASWkvrJrv3YZHEDAaW" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/279.6379b73f.chunk.js.map"] will be destroyed
  # (because key ["static/js/279.6379b73f.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "680fb45ed16149b602d9ee97a50bbb8a" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/279.6379b73f.chunk.js.map" -> null
      - key                    = "static/js/279.6379b73f.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/279.6379b73f.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "FsWM2W5rE0hl6eLWqdocjxPdVFkiu9kl" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/496.6b12bb7f.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "9f831a596c911b9491fdebbaa7e3f43b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/496.6b12bb7f.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/496.6b12bb7f.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/496.6b12bb7f.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "581433973fccea5a4ca4286ed3e9f02b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/496.6b12bb7f.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/496.6b12bb7f.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/496.71d68e66.chunk.js"] will be destroyed
  # (because key ["static/js/496.71d68e66.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "35ad90b9596e3c78f96ffaa4b125015e" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/496.71d68e66.chunk.js" -> null
      - key                    = "static/js/496.71d68e66.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/496.71d68e66.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "Ar0CgvhhqKBtHO5hHLt2XniGlRHhdi8J" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/496.71d68e66.chunk.js.map"] will be destroyed
  # (because key ["static/js/496.71d68e66.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "014689d0f7edd3d74066913c7f882e02" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/496.71d68e66.chunk.js.map" -> null
      - key                    = "static/js/496.71d68e66.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/496.71d68e66.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "pN7zPiZv8FxQTWIkkBqBxzJoZW5SYyoz" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/612.1313f78c.chunk.js"] will be destroyed
  # (because key ["static/js/612.1313f78c.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "6a6dd61e75e73dd8e766214ec0630de8" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/612.1313f78c.chunk.js" -> null
      - key                    = "static/js/612.1313f78c.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/612.1313f78c.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "eugyf2iEcR5YmKGrzBMZ9.JvyMz5AK3d" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/612.1313f78c.chunk.js.map"] will be destroyed
  # (because key ["static/js/612.1313f78c.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "d493ab3c84e03907fd8794a413169432" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/612.1313f78c.chunk.js.map" -> null
      - key                    = "static/js/612.1313f78c.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/612.1313f78c.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "6dxpbPvm2aRr8QC8ntHHwrKNwUEcZ2Cu" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/726.51f7dd57.chunk.js"] will be destroyed
  # (because key ["static/js/726.51f7dd57.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "62971b18f8cb874477df910dfe941b21" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/726.51f7dd57.chunk.js" -> null
      - key                    = "static/js/726.51f7dd57.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/726.51f7dd57.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "SW7_nBHxi6CHuy989uLX.5XFqk4JqcOw" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/726.51f7dd57.chunk.js.map"] will be destroyed
  # (because key ["static/js/726.51f7dd57.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "ee1fedb75063543d92e96e801966f13d" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/726.51f7dd57.chunk.js.map" -> null
      - key                    = "static/js/726.51f7dd57.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/726.51f7dd57.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "DP8XRN_FoYWdxWXVBZuo1MFwHmmKnRTA" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/726.7c7cb641.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "59a31024dd0b576d6cb1322bdcf050c0"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/726.7c7cb641.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/726.7c7cb641.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/726.7c7cb641.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "05bd3fe2f7dd3bbe594ef71cc81a5457"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/726.7c7cb641.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/726.7c7cb641.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/777.cf1c154f.chunk.js"] will be destroyed
  # (because key ["static/js/777.cf1c154f.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "9aa863435a17ca13a1232aa279ea008c" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/777.cf1c154f.chunk.js" -> null
      - key                    = "static/js/777.cf1c154f.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/777.cf1c154f.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "WsB8MWZawQiThyWA5jVqtXrxlcMNkeK1" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/777.cf1c154f.chunk.js.map"] will be destroyed
  # (because key ["static/js/777.cf1c154f.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "ce310d6fb6aed77e1fb16da6c8114992" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/777.cf1c154f.chunk.js.map" -> null
      - key                    = "static/js/777.cf1c154f.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/777.cf1c154f.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "wTeApOIwGkBYzwo3ClBPZpUB5HGkluRX" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/777.dc23ef38.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "37e505f70da1e949c1801367bafcc15d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/777.dc23ef38.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/777.dc23ef38.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/777.dc23ef38.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "4b8af333813768982a53b935cf3da8b6"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/777.dc23ef38.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/777.dc23ef38.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/924.16f99540.chunk.js"] will be destroyed
  # (because key ["static/js/924.16f99540.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "6a4a570635a3d501a332e130f08183f7" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/924.16f99540.chunk.js" -> null
      - key                    = "static/js/924.16f99540.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/924.16f99540.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "meKupBR1xuAFwEJPrk7vhyeVJR9vAih0" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/924.16f99540.chunk.js.map"] will be destroyed
  # (because key ["static/js/924.16f99540.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "66537a7ec11fd7d9dbec1cc57872be87" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/924.16f99540.chunk.js.map" -> null
      - key                    = "static/js/924.16f99540.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/924.16f99540.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "6D6uVsE6JPs6EXe9RlhI5Xfhaf9gUfZP" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/924.883baa43.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "a8b4f0a5972867daeb6d9ff08bdbdad3"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/924.883baa43.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/924.883baa43.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/924.883baa43.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "a20ab4f795768af5c1fdd86e8eb828cf"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/924.883baa43.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/924.883baa43.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.39c4d091.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "ddf297347d5fde9f23c83ce6e8b06fb0"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.39c4d091.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.39c4d091.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.39c4d091.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "1ba185ef4fa84c39c42d736c34f51a0a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.39c4d091.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.39c4d091.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.39c4d091.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "c444630b8efd6f91494539b9db201877"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.39c4d091.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.39c4d091.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.e083a45e.js"] will be destroyed
  # (because key ["static/js/main.e083a45e.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "0b81c955c871b9595a2324af6959d4f2" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.e083a45e.js" -> null
      - key                    = "static/js/main.e083a45e.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.e083a45e.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "U5e77_xFiPUc.7LEAde9j__vf98wpO54" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.e083a45e.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/main.e083a45e.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "0ac550b1d44507bce29e441214b0a192" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.e083a45e.js.LICENSE.txt" -> null
      - key                    = "static/js/main.e083a45e.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.e083a45e.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "gfUnoU4RzjNsn8JJuOdYwrwVfV03b0jX" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.e083a45e.js.map"] will be destroyed
  # (because key ["static/js/main.e083a45e.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "85f075fa73495732c3f78aa63351de2b" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.e083a45e.js.map" -> null
      - key                    = "static/js/main.e083a45e.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.e083a45e.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "6sN50blfxr30z7ONTTOlNLbkEPLiqGkx" -> null
    }

Plan: 22 to add, 2 to change, 22 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 37 estimated
           $0.0/mo +$0.0

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @dependabot[bot], Action: `pull_request`*